clear all;
close all;

N1=440;
x1(1,:)=-1.7+0.9*randn(1,N1);         % 1类440个训练样本,3维正态分布
x1(2,:)= 1.6+0.7*randn(1,N1);
x1(3,:)=-1.5+0.8*randn(1,N1);

N2=400;
x2(1,:)= 1.3+1.2*randn(1,N2);         % 2类400个训练样本,3维正态分布
x2(2,:)=-1.5+1.3*randn(1,N2);
x2(3,:)= 1.4+1.1*randn(1,N2);

plot3(x1(1,:),x1(2,:),x1(3,:),'*',x2(1,:),x2(2,:),x2(3,:),'o');
grid on;
axis equal;
axis([-5 5 -5 5 -5 5]);

u1=sum(x1')/N1;                       % 1类均值估计
u1=u1'
for i=1:N1 xu1(:,i)=x1(:,i)-u1;end;
e1=(xu1*xu1')/(N1-1)                  % 1类协方差矩阵估计

u2=sum(x2')/N2;                       % 2类均值估计
u2=u2'
for i=1:N2 xu2(:,i)=x2(:,i)-u2;end;
e2=(xu2*xu2')/(N2-1)                  % 2类协方差矩阵估计
